{
  "backend/main.mo": "Defines core data models for products, stock, promotions, transactions, and users, and initializes in‑memory maps with access control mixin.",
  "feature_evidence.json": "Lists feature implementation evidence, mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries of various frontend files for reference.",
  "frontend/index.css": "Defines Tailwind base variables and themes using OKLCH colors with light/dark mode support.",
  "frontend/index.html": "Minimal HTML entry point mounting the React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app metadata, icons, and theme color.",
  "frontend/public/sw.js": "Service worker providing basic offline caching for core assets.",
  "frontend/src/App.tsx": "Sets up the full application router, theme provider, and app layout with all page routes.",
  "frontend/src/components/AppLayout.tsx": "Main layout component providing navigation links, theme toggle, user menu, and logout handling based on user role.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays an alert when the browser goes offline, updating automatically based on network events.",
  "frontend/src/features/admin/sampleData.ts": "Defines and saves sample categories, products, and payment methods, then queues them for backend sync.",
  "frontend/src/features/admin/SampleDataLoaderCard.tsx": "UI card that lets admins load predefined sample data into local storage with confirmation and status feedback.",
  "frontend/src/features/admin/UsersPage.tsx": "User management page showing role explanations and including the sample data loader tool.",
  "frontend/src/features/auth/AdminReauthDialog.tsx": "Dialog requiring admin reauthentication via Internet Identity before performing sensitive actions.",
  "frontend/src/features/auth/AuthGate.tsx": "Handles authentication flow, showing login, loading, or profile setup before rendering protected content.",
  "frontend/src/features/auth/IdleLock.tsx": "Locks the session after inactivity and requires reauthentication to resume usage.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Dialog for first-time users to enter their name and role, saving the profile via backend mutation.",
  "frontend/src/features/auth/useCurrentUser.ts": "Fetches the current user's profile and admin role using react‑query and returns loading and state flags.",
  "frontend/src/features/barcode/barcodeResolver.ts": "Searches products and their variants to find and return the matching barcode entry.",
  "frontend/src/features/barcode/CameraBarcodeScanner.tsx": "Renders a camera-based barcode scanner with fallback manual input and handles camera access errors.",
  "frontend/src/features/barcode/HidBarcodeListener.ts": "Listens for rapid keypress sequences from HID barcode scanners and triggers onScan when Enter is pressed.",
  "frontend/src/features/catalog/catalogFormModel.ts": "Defines product form data structure and validates required fields and pricing constraints.",
  "frontend/src/features/catalog/CatalogPage.tsx": "Provides UI for creating, editing, and listing products and categories using local master data and sync queueing.",
  "frontend/src/features/catalog/catalogStore.ts": "Exports product keys and applies upsert updates by merging products into a map.",
  "frontend/src/features/catalog/ProductCsvPage.tsx": "Handles CSV export and import of products with error reporting and user feedback.",
  "frontend/src/features/checkout/CheckoutPage.tsx": "Manages checkout flow including payments, stock updates, and transaction creation.",
  "frontend/src/features/checkout/paymentValidation.ts": "Validates payment totals and ensures at least one payment covers the amount due.",
  "frontend/src/features/inventory/InventoryPage.tsx": "Displays stock levels, low‑stock alerts, and allows manual stock adjustments with sync tracking.",
  "frontend/src/features/inventory/inventoryStore.ts": "Zustand store managing the low‑stock threshold setting.",
  "frontend/src/features/inventory/ReceivingPage.tsx": "UI for recording received stock, updating product quantities and costs, and queuing receiving data for sync.",
  "frontend/src/features/payments/PaymentMethodsPage.tsx": "UI for listing, creating, and toggling custom payment methods with offline master data updates.",
  "frontend/src/features/pos/cartStore.ts": "Zustand store handling cart items, discounts, tax calculation, and persistence.",
  "frontend/src/features/pos/PosPage.tsx": "Point‑of‑sale UI with product search, barcode scanning, cart management, and navigation to checkout.",
  "frontend/src/features/pos/priceTier.ts": "Helpers for selecting price tiers and retrieving wholesale or retail pricing.",
  "frontend/src/features/pos/productSelectors.ts": "Selector hook returning active products and a search function filtering by name, SKU, or barcode.",
  "frontend/src/features/promotions/promoEngine.ts": "Logic for checking promotion eligibility and calculating discount amounts based on promo type.",
  "frontend/src/features/promotions/PromotionsPage.tsx": "UI for creating and managing promotions stored in offline master data.",
  "frontend/src/features/pwa/PwaInstallGuidePage.tsx": "Renders a PWA installation guide with install button logic, benefits list, and platform-specific instructions.",
  "frontend/src/features/receipts/PrintReceiptDialog.tsx": "Provides a dialog to preview and print receipts with selectable width options.",
  "frontend/src/features/receipts/ReceiptTemplate.tsx": "Generates a printable receipt layout including store header, items, totals, and payments.",
  "frontend/src/features/reports/reportCalculations.ts": "Contains functions to compute daily summaries and product-level sales aggregates from transactions.",
  "frontend/src/features/reports/ReportsPage.tsx": "Displays date-filtered sales reports with summaries, product stats, and CSV export functionality.",
  "frontend/src/features/returns/ReturnFlowPage.tsx": "Implements a returns search form and displays return policy information; backend logic is stubbed.",
  "frontend/src/features/sync/SyncStatusPage.tsx": "Shows offline sync queue status, supports manual sync, and displays pending, failed, and last sync info.",
  "frontend/src/features/transactions/TransactionDetailsPage.tsx": "Renders a transaction detail view by loading a transaction from offline storage and displaying items, payments, and print options.",
  "frontend/src/features/transactions/transactionLedger.ts": "Provides helpers to calculate net sales from transactions and to apply refunded items back to inventory.",
  "frontend/src/features/void/VoidTransactionDialog.tsx": "Dialog for voiding a transaction, collecting a reason, and triggering admin reauthentication.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling login, stored identity loading, and status tracking.",
  "frontend/src/i18n/format.ts": "Utility functions for formatting currency, dates, and numbers using Indonesian locale.",
  "frontend/src/i18n/strings.id.ts": "Centralized Indonesian translation strings for navigation, POS, checkout, catalog, and other modules.",
  "frontend/src/i18n/t.ts": "Simple translation helpers to resolve string keys and arrays from the Indonesian locale object.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and glass-effect utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/offline/masterDataCache.ts": "React Query hook for fetching cached master data from offline storage.",
  "frontend/src/offline/storage.ts": "Implements IndexedDB setup and CRUD helpers for master data, transactions, and a sync queue. Also queues new transactions for later syncing.",
  "frontend/src/offline/syncQueue.ts": "Retrieves and processes sync queue items, updating their status and retry attempts. Includes placeholder sync logic and IndexedDB update helpers.",
  "frontend/src/pwa/useInstallPrompt.ts": "Provides a React hook to manage PWA install prompts, track install availability, and trigger installation. Handles beforeinstallprompt and appinstalled events.",
  "frontend/src/utils/csvExport.ts": "Exports generic data arrays to semicolon-delimited CSV files with value escaping. Creates and downloads a CSV blob.",
  "frontend/src/utils/csvParse.ts": "Exports products to semicolon-delimited CSV and imports product CSV files with validation and parsing. Constructs product objects to save or sync later.",
  "frontend/src/utils/urlParams.ts": "Utility functions to get, store, persist, and clear URL parameters, supporting both query and hash routing. Includes sessionStorage-backed persistence helpers.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugins, custom colors, typography, container settings, and animations. Extends theme with design system tokens.",
  "project_state.json": "Contains project version, goals, architectural decisions, known issues, and existing feature definitions for a Motoko + React PWA POS rebuild. Serves as a full-state specification for required fixes, UI updates, and inventory/checkout corrections."
}