{
  "backend/main.mo": "Defines the main canister with product, stock, promotion, payment, transaction, and user types plus maps for state and authorization mixin setup.",
  "backend/migration.mo": "Contains a simple migration module that returns old category data unchanged.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for the POS system.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files including offline storage, i18n, catalog utilities, and UI components.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point loading the root container and main React script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme color, icons, and startup configuration.",
  "frontend/public/sw.js": "Service worker implementing basic asset caching, fetch interception, and cache cleanup.",
  "frontend/src/App.tsx": "Main application router setup with themed layout, authentication gate, and route definitions for all POS pages.",
  "frontend/src/components/AppLayout.tsx": "Defines the main application layout with navigation links, theme toggling, user menu, and logout handling based on authentication and admin status.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows a warning alert when the browser goes offline by listening to online/offline events.",
  "frontend/src/features/admin/sampleData.ts": "Defines preset sample categories, products, and payment methods, saves them to offline storage, and queues them for sync.",
  "frontend/src/features/admin/SampleDataLoaderCard.tsx": "Provides a UI card to load sample categories, products, and payment methods, including confirmation and loading states.",
  "frontend/src/features/admin/UsersPage.tsx": "Renders the user management page with role descriptions and includes the sample data loader tool.",
  "frontend/src/features/auth/AdminReauthDialog.tsx": "Displays a dialog requiring admin reauthentication for sensitive actions using Internet Identity login.",
  "frontend/src/features/auth/AuthGate.tsx": "Gates access based on authentication state, showing login UI or profile setup when needed before rendering children.",
  "frontend/src/features/auth/IdleLock.tsx": "Locks the session after inactivity and requires reauthentication to unlock, tracking user activity events.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Prompts newly authenticated users to enter name and role, saving the profile via an actor mutation.",
  "frontend/src/features/auth/useCurrentUser.ts": "Fetches and returns the current user profile and admin role using React Query and an actor instance.",
  "frontend/src/features/barcode/barcodeResolver.ts": "Searches products and variants to find a matching barcode and returns the matched objects.",
  "frontend/src/features/barcode/CameraBarcodeScanner.tsx": "Displays a camera-based barcode scanner with manual input fallback and handles camera permission errors.",
  "frontend/src/features/barcode/HidBarcodeListener.ts": "Listens for HID keyboard-style barcode input and triggers a scan callback when Enter is pressed.",
  "frontend/src/features/catalog/catalogFormModel.ts": "Defines product form data structure and validates required fields and pricing rules.",
  "frontend/src/features/catalog/CatalogPage.tsx": "Manages product and category creation/editing with dialogs, form state, offline storage, and syncing.",
  "frontend/src/features/catalog/catalogStore.ts": "Exports product keys and applies upsert updates to a product list via ID mapping.",
  "frontend/src/features/catalog/ProductCsvPage.tsx": "Provides CSV import/export for products with error handling and format instructions.",
  "frontend/src/features/checkout/CheckoutPage.tsx": "Handles checkout flow including payments, validation, transaction creation, and navigation.",
  "frontend/src/features/checkout/paymentValidation.ts": "Validates payment totals ensuring payments exist and cover the amount due.",
  "frontend/src/features/inventory/InventoryPage.tsx": "Displays stock levels, highlights low-stock items, and allows stock adjustments with offline syncing.",
  "frontend/src/features/inventory/inventoryStore.ts": "Zustand store for managing a global low‑stock threshold setting.",
  "frontend/src/features/inventory/ReceivingPage.tsx": "UI for recording incoming stock, updating product quantities and variant costs, and syncing receiving records offline.",
  "frontend/src/features/payments/PaymentMethodsPage.tsx": "Page to add and manage payment methods, including enabling or disabling them and syncing changes offline.",
  "frontend/src/features/pos/cartStore.ts": "Persistent Zustand cart store handling item management, discounts, tax, and computed totals.",
  "frontend/src/features/pos/PosPage.tsx": "POS interface with product search, barcode scanning, cart operations, and checkout navigation.",
  "frontend/src/features/pos/priceTier.ts": "Utility functions to select price tiers based on quantity and return appropriate variant pricing.",
  "frontend/src/features/pos/productSelectors.ts": "Hook that filters active products and supports searching by name, SKU, and barcode.",
  "frontend/src/features/promotions/promoEngine.ts": "Logic to check promotion eligibility and compute discount amounts based on promotion rules.",
  "frontend/src/features/promotions/PromotionsPage.tsx": "UI for creating and listing promotions with fields like type, value, coupon codes, and active status.",
  "frontend/src/features/pwa/PwaInstallGuidePage.tsx": "Page showing PWA install options, benefits, and step-by-step instructions with install prompt handling and toast messages.",
  "frontend/src/features/receipts/PrintReceiptDialog.tsx": "Dialog for selecting receipt width, previewing a receipt, and triggering browser print.",
  "frontend/src/features/receipts/ReceiptTemplate.tsx": "Generates printable receipt layout using transaction details, totals, and payment breakdown.",
  "frontend/src/features/reports/reportCalculations.ts": "Utility functions computing daily revenue summaries and aggregated product sales.",
  "frontend/src/features/reports/ReportsPage.tsx": "Displays sales reports with date filtering, summaries, product data, and CSV export.",
  "frontend/src/features/returns/ReturnFlowPage.tsx": "UI for entering a transaction ID and showing basic return policy, with placeholder search logic.",
  "frontend/src/features/sync/SyncStatusPage.tsx": "Monitors offline sync queue, shows counts and last sync time, and allows manual syncing.",
  "frontend/src/features/transactions/TransactionDetailsPage.tsx": "Displays detailed transaction info, including items, payments, and print option, loaded via offline storage.",
  "frontend/src/features/transactions/transactionLedger.ts": "Provides functions to compute net sales accounting for refunds and to return refunded items back to inventory.",
  "frontend/src/features/void/VoidTransactionDialog.tsx": "Dialog for voiding a transaction requiring a reason and admin reauthentication before confirming.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and logout functionality.",
  "frontend/src/i18n/format.ts": "Utility functions for formatting currency, dates, date-times, and numbers using Indonesian locale.",
  "frontend/src/i18n/strings.id.ts": "Contains all Indonesian translation strings for navigation, POS, checkout, catalog, and common UI text.",
  "frontend/src/i18n/t.ts": "Simple translation helper that resolves keys into Indonesian strings, with fallback warnings for missing keys.",
  "frontend/src/index.css": "Tailwind CSS base styles, color variables, dark mode, utility classes, and print styles for receipts.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with Internet Identity provider.",
  "frontend/src/offline/masterDataCache.ts": "Provides a hook to load cached master data from offline storage via React Query.",
  "frontend/src/offline/storage.ts": "Implements IndexedDB storage for master data, transactions, and sync queue with CRUD helpers and queuing for sync.",
  "frontend/src/offline/syncQueue.ts": "Provides sync queue retrieval and processing, updating item status and attempts with placeholder sync logic.",
  "frontend/src/pwa/useInstallPrompt.ts": "React hook managing PWA installation prompt, tracking availability and installation state.",
  "frontend/src/utils/csvExport.ts": "Exports generic data arrays to semicolon-delimited CSV files using browser Blob download.",
  "frontend/src/utils/csvParse.ts": "Exports product CSV and imports semicolon-delimited product data, validating rows and preparing product objects.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Describes the PWA POS project state, architecture decisions, known issues, and existing implemented features. Highlights Motoko backend, React frontend, offline-lite constraints, CSV delimiter choice, and several UI/feature bugs."
}