{
  "backend/main.mo": "Defines core POS backend types and state maps for products, stock, transactions, promotions, and authorization with initial structures but truncated before save operations.",
  "feature_evidence.json": "Feature evidence report linking checkout and transaction-calculation fixes to specific frontend files and components.",
  "frontend-file-summaries.txt": "List of frontend file paths mapped to short functional descriptions covering utilities, features, offline storage, and UI components.",
  "frontend/index.css": "Tailwind-based global style layer configuring OKLCH theme variables for light and dark modes with shared component styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining TOKO FADLI branding, icons, theme colors, and display settings.",
  "frontend/public/sw.js": "Simple service worker caching static assets with install, fetch, and activate handlers.",
  "frontend/src/App.tsx": "React router setup defining all application routes with theme provider, auth gate, and layout wrapper.",
  "frontend/src/components/AppLayout.tsx": "Global application layout with navigation, user menu, theming, and role-based admin links using Indonesian translations.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows an alert when the browser is offline, updating state via online/offline events.",
  "frontend/src/features/admin/sampleData.ts": "Loads predefined categories, products, and payment methods into local storage and queues them for sync.",
  "frontend/src/features/admin/SampleDataLoaderCard.tsx": "Card UI that triggers loading sample data with confirmation and loading states.",
  "frontend/src/features/admin/UsersPage.tsx": "User management page showing role info and including the sample data loader card.",
  "frontend/src/features/auth/AdminReauthDialog.tsx": "Dialog prompting admins to reauthenticate via Internet Identity before sensitive actions.",
  "frontend/src/features/auth/AuthGate.tsx": "Protects routes by handling login, profile setup, and loading states for authenticated users.",
  "frontend/src/features/auth/IdleLock.tsx": "Locks the session after inactivity and requires reauthentication to unlock.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Dialog for creating a user profile with name and role, saving via actor API.",
  "frontend/src/features/auth/useCurrentUser.ts": "Hook fetching the current user profile and role from the backend actor.",
  "frontend/src/features/barcode/barcodeResolver.ts": "Finds a matching product variant by barcode from a product list.",
  "frontend/src/features/barcode/CameraBarcodeScanner.tsx": "Camera-based barcode scanner with error handling and manual input fallback.",
  "frontend/src/features/barcode/HidBarcodeListener.ts": "Hook that listens for fast keyboard input to detect HID barcode scans.",
  "frontend/src/features/catalog/catalogFormModel.ts": "Defines product form structure and validates required fields and pricing rules.",
  "frontend/src/features/catalog/CatalogPage.tsx": "Product and category management UI allowing creation, editing, and syncing of catalog data with offline storage.",
  "frontend/src/features/catalog/catalogStore.ts": "Exports functions to derive product keys and apply upsert updates to product lists.",
  "frontend/src/features/catalog/ProductCsvPage.tsx": "Allows exporting products to CSV and importing product data from CSV with error handling.",
  "frontend/src/features/checkout/CheckoutPage.tsx": "Checkout interface handling cart totals, multiple payments, validation, and transaction creation.",
  "frontend/src/features/checkout/paymentValidation.ts": "Validates payment entries ensuring amounts are valid and cover the total due.",
  "frontend/src/features/inventory/InventoryPage.tsx": "Displays stock levels, highlights low-stock items, and allows stock adjustments with sync support.",
  "frontend/src/features/inventory/inventoryStore.ts": "Zustand store for managing low‑stock threshold settings.",
  "frontend/src/features/inventory/ReceivingPage.tsx": "Handles receiving stock from suppliers, updating product stock and cost, and syncing entries.",
  "frontend/src/features/payments/PaymentMethodsPage.tsx": "Manages payment methods with create, toggle-enabled, and offline sync support using dialogs and tables.",
  "frontend/src/features/pos/cartStore.ts": "Defines a persisted Zustand store for cart items, discounts, tax, and computed totals with mutation helpers.",
  "frontend/src/features/pos/PosPage.tsx": "Implements the POS interface with product search, barcode scanning, cart management, and checkout navigation.",
  "frontend/src/features/pos/priceTier.ts": "Provides helpers to select a price tier based on quantity and return retail or wholesale prices.",
  "frontend/src/features/pos/productSelectors.ts": "Exposes hooks for filtering active products and performing text or SKU/barcode search.",
  "frontend/src/features/promotions/promoEngine.ts": "Contains logic to check promotion eligibility and compute discount amounts.",
  "frontend/src/features/promotions/PromotionsPage.tsx": "UI for creating and listing promotions with offline storage and sync integration.",
  "frontend/src/features/pwa/PwaInstallGuidePage.tsx": "Displays PWA installation instructions and triggers install prompts with localized content.",
  "frontend/src/features/receipts/PrintReceiptDialog.tsx": "Dialog for previewing and printing receipts with selectable paper width using ReceiptTemplate.",
  "frontend/src/features/receipts/ReceiptTemplate.tsx": "Renders a printable receipt layout showing transaction details, items, totals, and payments with responsive widths.",
  "frontend/src/features/reports/reportCalculations.ts": "Provides helper functions to compute daily revenue summaries and aggregate product sales from transactions.",
  "frontend/src/features/reports/ReportsPage.tsx": "Displays reporting UI with date filtering, revenue summaries, product sales data, and CSV export functionality.",
  "frontend/src/features/returns/ReturnFlowPage.tsx": "Implements a basic return lookup UI with transaction ID search placeholder and return policy display.",
  "frontend/src/features/sync/SyncStatusPage.tsx": "Shows offline sync queue status, pending/failed counts, last sync time, and triggers manual synchronization.",
  "frontend/src/features/transactions/TransactionDetailsPage.tsx": "Loads and displays transaction details, items, payments, and offers receipt printing and navigation controls.",
  "frontend/src/features/transactions/transactionLedger.ts": "Contains functions to compute net sales based on refund/void status and update inventory after refunds.",
  "frontend/src/features/void/VoidTransactionDialog.tsx": "Provides a dialog to void a transaction with reason input and admin reauthentication before confirming.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, logout, and status helpers. Includes AuthClient setup and restores identity on mount.",
  "frontend/src/i18n/format.ts": "Utility functions for formatting currency, dates, times, and numbers using Indonesian locale settings.",
  "frontend/src/i18n/strings.id.ts": "Indonesian translation dictionary containing UI strings for auth, navigation, POS, catalog, CSV, and other app sections.",
  "frontend/src/i18n/t.ts": "Simple translation helpers that resolve nested keys from the Indonesian strings dictionary, with fallback and array support.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode, and custom glass-effect utility classes.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/offline/masterDataCache.ts": "React Query hook that loads cached master data from IndexedDB and keeps it fresh for five minutes.",
  "frontend/src/offline/storage.ts": "IndexedDB storage layer for master data, transactions, and sync queue, including CRUD helpers and automatic queueing of new transactions.",
  "frontend/src/offline/syncQueue.ts": "Manages reading and processing sync queue items from IndexedDB, updating statuses and retry attempts with placeholder sync logic.",
  "frontend/src/pwa/useInstallPrompt.ts": "Hook that manages PWA installation prompts, tracking install eligibility, installation state, and providing an install trigger.",
  "frontend/src/utils/csvExport.ts": "Exports arbitrary data arrays to semicolon-delimited CSV and triggers a browser download with proper value escaping.",
  "frontend/src/utils/csvParse.ts": "Provides semicolon-delimited CSV export for products and a custom CSV importer that validates headers, parses quoted fields, constructs product objects, and records import errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters (including hash mode), persisting them in sessionStorage, and clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radius, shadows, keyframes, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing PWA POS goals, architecture decisions, known issues, and existing feature definitions."
}