{
  "kind": "build_request",
  "title": "Fix Checkout totals showing Rp 0 and make payment remaining/change update live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Fix the Checkout order summary calculations so Subtotal, Tax, Discount, and Total are always computed from the current cart contents and never display Rp 0 when the cart has priced items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8"
        ],
        "quotes": [
          "TUH BRO LO LIATA DEH TOTALNYA MASIH TERBACA 0 RUPIAH",
          "Gas bang, build"
        ]
      },
      "acceptanceCriteria": [
        "Given a cart with multiple items and non-zero prices, the Checkout page shows non-zero Subtotal and Total matching the cart contents.",
        "Subtotal displayed in Checkout equals the sum of (item price * qty) minus per-item discounts, before cart-level discount and tax.",
        "If tax is enabled in the cart, Checkout shows Tax as 10% of (subtotal - cart-level discount), rounded consistently with the cart store logic.",
        "Total displayed in Checkout equals (subtotal - cart-level discount + tax) and matches the cart store’s computed total.",
        "The Checkout calculations update immediately when cart state changes (e.g., returning to POS, modifying quantities/discounts/tax, then re-opening Checkout) without requiring a page reload."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Fix the Checkout payment calculations so Remaining and Change are always correct and update live as the cashier adds/removes payments and edits amounts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "perlu brooooo perlu banget"
        ]
      },
      "acceptanceCriteria": [
        "Remaining equals max(0, totalDue - totalPaid) and updates immediately when payments are added or removed.",
        "Change equals max(0, totalPaid - totalDue) and becomes visible immediately when totalPaid exceeds totalDue.",
        "The “Complete Transaction” button remains disabled while Remaining > 0 and becomes enabled as soon as Remaining reaches 0.",
        "Validation uses the same totalDue value that is displayed as Total in Checkout (no mismatches between UI and validation)."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Ensure the transaction payload created during checkout stores consistent monetary fields (subtotal, discount, tax, total) derived from the cart calculations, so receipts and transaction details display correct amounts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8"
        ],
        "quotes": [
          "TUH BRO LO LIATA DEH TOTALNYA MASIH TERBACA 0 RUPIAH",
          "Gas bang, build"
        ]
      },
      "acceptanceCriteria": [
        "When a transaction is created, stored subtotal/discount/tax/total match the values displayed in Checkout at the moment of completion.",
        "The printed receipt (58mm/80mm) and Transaction Details screen show the same total as Checkout for the completed transaction.",
        "No stored monetary field becomes negative; if discounts exceed subtotal, values are clamped consistently with cart store behavior."
      ]
    }
  ],
  "constraints": [
    "Use English for any new or modified user-facing text introduced by this change.",
    "Do not edit files under frontend/src/components/ui (shadcn components must be composed, not modified).",
    "Do not modify immutable hook paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Implementing or changing backend/Motoko transaction calculation logic (this request is focused on fixing the frontend checkout/payment calculations and stored transaction payload values).",
    "Replacing the mocked payment methods list in Checkout with backend-driven payment methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}