{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Checkout totals and live payment remaining/change calculations",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Ensure Checkout order summary (Subtotal/Tax/Discount/Total) is always computed from the live cart store calculations and never shows Rp 0 for priced carts.",
      "acceptanceCriteria": [
        "Given a cart with multiple items and non-zero prices, the Checkout page shows non-zero Subtotal and Total matching the cart contents.",
        "Subtotal displayed in Checkout equals the sum of (item price * qty) minus per-item discounts, before cart-level discount and tax.",
        "If tax is enabled in the cart, Checkout shows Tax as 10% of (subtotal - cart-level discount), rounded consistently with the cart store logic.",
        "Total displayed in Checkout equals (subtotal - cart-level discount + tax) and matches the cart store’s computed total.",
        "The Checkout calculations update immediately when cart state changes (e.g., returning to POS, modifying quantities/discounts/tax, then re-opening Checkout) without requiring a page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/pos/cartStore.ts",
          "operation": "modify",
          "description": "Prevent persisted cart state from overwriting computed monetary getters by configuring zustand persist to store only base fields (cart, cartDiscount, taxEnabled). Keep cartSubtotal/cartTax/cartTotal derived from current cart contents and clamped to non-negative values."
        },
        {
          "path": "frontend/src/features/checkout/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Use cart store’s computed fields (cartSubtotal/cartDiscount/cartTax/cartTotal) directly for the order summary; ensure displayed Subtotal reflects per-item discounts and updates on any cart change (no derived formula that can desync)."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Make Checkout payment Remaining/Change computations correct and fully reactive to payment add/remove/edit, and keep completion validation aligned with displayed Total.",
      "acceptanceCriteria": [
        "Remaining equals max(0, totalDue - totalPaid) and updates immediately when payments are added or removed.",
        "Change equals max(0, totalPaid - totalDue) and becomes visible immediately when totalPaid exceeds totalDue.",
        "The “Complete Transaction” button remains disabled while Remaining > 0 and becomes enabled as soon as Remaining reaches 0.",
        "Validation uses the same totalDue value that is displayed as Total in Checkout (no mismatches between UI and validation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/checkout/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add live-edit support for existing payment entries (editable amount per row) and recompute totalPaid/remaining/change from current payments and cartTotal. Ensure the Complete Transaction button disabled state and validatePayment() both use the exact same totalDue value shown in the UI (cartTotal)."
        },
        {
          "path": "frontend/src/features/checkout/paymentValidation.ts",
          "operation": "modify",
          "description": "Align validation expectations with the Checkout totals by ensuring validation checks are performed against the provided totalDue value (the same value displayed as Total), and treat negative/NaN payment amounts as invalid to prevent mismatches during live edits."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Store consistent monetary fields in the created transaction payload (subtotal/discount/tax/total) derived from cart calculations so receipt and transaction details show correct amounts.",
      "acceptanceCriteria": [
        "When a transaction is created, stored subtotal/discount/tax/total match the values displayed in Checkout at the moment of completion.",
        "The printed receipt (58mm/80mm) and Transaction Details screen show the same total as Checkout for the completed transaction.",
        "No stored monetary field becomes negative; if discounts exceed subtotal, values are clamped consistently with cart store behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/offline/storage.ts",
          "operation": "modify",
          "description": "Extend the offline createTransaction storage logic to accept and persist the monetary breakdown fields (subtotal, discount, tax, total) from Checkout instead of overwriting them with defaults, while keeping values non-negative."
        },
        {
          "path": "frontend/src/features/checkout/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Build the transaction payload using the cart store’s computed monetary fields (subtotal/discount/tax/total) at completion time, and pass them through to offline createTransaction so stored values match what Checkout displays."
        },
        {
          "path": "frontend/src/features/receipts/ReceiptTemplate.tsx",
          "operation": "modify",
          "description": "Render receipt totals using the stored transaction monetary fields (subtotal/discount/tax/total) to ensure printed output matches Checkout at completion time, while keeping backward-compatible fallbacks for older stored transactions if needed."
        }
      ]
    }
  ]
}